---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodFiberCosineEnable
source: html/945ed1a1-c056-d688-cb85-c7035888753d.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodFiberCosineEnable Property

The property labeled "Use cosine function for wood fiber" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodFiberCosineEnable { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".